#include <iostream> /* для вводу і виводу в термінал (об'єкти cin cout) */
#include <vector> /* усе що зв'язане з std::vector */
using namespace std ; /* друкуємо vector без простору імен std */

/* головна функція програми */
int main (int argc, /* кількість аргументів*/
          char** argv) /* аргументи в масивах символів */
{
    /* оголошуємо примірник класу std::vector
    ** для розміщення послідовності цілих чисел */
    vector<int> v ;

    /* заповнюємо вектор послідовністю чисел від 1 до 20
    ** за допомогою методу push_back() */
    for (int x=1; x<=20; ++x)
    { v.push_back (x) ; }

    /* показуємо вмістимість вектора */
    cout << "Вмістимість вектора до видалення: "
         << v.capacity () << " елементи." << endl ;

    /* використовуючи метод erase і ітератори,
    ** видалимо кожне непарне число з об'єкта */
    for (vector<int>::iterator iter=v.begin(); /* ітератор класу vector*/
         iter<v.end();  /* охорона циклу */
         ++iter) /* крок ітерації */
    {
        /* видаляємо елемент, на який вказує ітератор iter */
        v.erase (iter) ;
    }

    /* виводимо на екран вміст вектору */
    for (int i=0; i<v.size(); ++i)
    {
        /* небезпечний оператор [] ! */
        cout << v[i] << " " ;
    }
    /* новий рядок після результатів*/
    cout << endl ;

    /* показуємо вмістимість вектора */
    cout << "Вмістимість вектора після видалення: "
         << v.capacity () << " елементи." << endl ;

    /* вихід з головної функції програми */
    return 0 ;
}

